In [1]:
%load_ext sql

In [92]:
%sql PRAGMA  SQL_safe_updates = OFF

 * sqlite:///stud_db.db
Done.

[]

In [3]:
%sql sqlite:///stud_db.db

In [4]:
%%sql
CREATE TABLE personal_details (
national_ID INTEGER(15) , stud_ID VARCHAR(15),stud_name VARCHAR(100),
phone_number VARCHAR(15),age INTEGER, gender VARCHAR(10),
PRIMARY KEY(national_ID) );

 * sqlite:///stud_db.db
Done.

[]

In [5]:
%%sql
INSERT INTO personal_details (national_ID,stud_ID,stud_name,phone_number,age,gender)
VALUES("344534","stud101","Hermione Granger" ,"0712345678",20,"Male"),
("379683","stud102","Draco Malfo" ,"0723456781",21,"Female"),
("347403","stud103","Jayden Wamashati" ,"0734567812",22,"Male"),
("377302","stud104","Ron Weasley" ,"0745678123",19,"Female"),
("336741","stud105","Dolores Umbridge" ,"0756781234",21,"Male"),
("307243","stud106","Hedwig Tonks" ,"0767812345",21,"Female"),
("310932","stud107","Chao Chang" ,"0778123456",22,"Male"),
("343920","stud108","Curfew Yaeitpm" ,"0781234567",20,"Female"),
("345261","stud109","Chaptr Mukenya" ,"0722345678",20,"Male"),
("339152","stud110","Natalie Mpema" ,"0733456781",21,"Female"),
("339746","stud111","Crew Nundi" ,"0744567812",20,"Male"),
("336373","stud112","Bandi Kagunda" ,"0755678123",22,"Female"),
("325252","stud113","Testimony Omolo" ,"0766456781",21,"Male"),
("321746","stud114","Career Mpya" ,"0741367812",20,"Male"),
("390234","stud115","Deamon Anduro" ,"0744421123",22,"Female");

 * sqlite:///stud_db.db
15 rows affected.

[]

In [6]:
%%sql
CREATE TABLE school_details(stud_ID VARCHAR(15), current_home_county VARCHAR(20),
secondary_school_county VARCHAR(20), residence VARCHAR(15), stud_email VARCHAR(50),
PRIMARY KEY (stud_ID)  );

 * sqlite:///stud_db.db
Done.

[]

In [7]:
%%sql
INSERT INTO school_details (stud_ID)
SELECT pd.stud_ID
FROM personal_details pd
LEFT JOIN school_details sd ON pd.stud_ID = sd.stud_ID
WHERE sd.stud_ID IS NULL;

 * sqlite:///stud_db.db
15 rows affected.

[]

In [8]:
%%sql
UPDATE school_details
SET stud_email = (SELECT REPLACE (stud_name,' ','') ||'@zinduaschool.ac'
					FROM personal_details
					WHERE school_details.stud_ID = personal_details.stud_ID) ;

 * sqlite:///stud_db.db
15 rows affected.

[]

In [9]:
%%sql
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud101";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [10]:
%sql UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud102";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [11]:
%sql UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud103";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [12]:
%sql UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud104";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [13]:
%sql UPDATE school_details SET current_home_county="Nyamira", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud105";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [14]:
%sql UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud106";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [15]:
%sql UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud107";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [16]:
%sql UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Mombasa", residence="Out of school" WHERE stud_ID="stud108";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [17]:
%sql UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud109";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [18]:
%sql UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud110";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [19]:
%sql UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Turkana", residence="In school" WHERE stud_ID="stud111";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [20]:
%sql UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud112";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [21]:
%sql UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Taita Taveta", residence="In school" WHERE stud_ID="stud113";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [22]:
%sql UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud114";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [23]:
%sql UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud115";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [24]:
%%sql
CREATE TABLE contact_details (stud_email VARCHAR(50)PRIMARY KEY , phone_number VARCHAR(15), next_of_kin_name VARCHAR(50),next_of_kin_relation VARCHAR(10), next_of_kin_contacts VARCHAR(13) );
INSERT INTO contact_details(phone_number, next_of_kin_name,next_of_kin_relation,next_of_kin_contacts)
VALUES("0712345678","Darius Young","Father","0782382383"),
("0723456781","Lucy Nderitu","Mother","0723238983"),
("0734567812","Jerotich Koech","Mother","0779343126"),
("0745678123","Mwaura Mwangi","Father","0798246347"),
("0756781234","Ian Patrick","Father","0711234453"),
("0767812345","Lebron James","Father","0765439233"),
("0778123456","Magna Carter","Father","0702526243"),
("0781234567","Cindy Wayne","Mother","0747282839"),
("0722345678","Farah Maalim","Mother","0753927482"),
("0733456781","Faiba Mbugua","Father","0713245748"),
("0744567812","John Doe","Father","0725737383"),
("0755678123","Klaus Michealson","Father","0789346276"),
("0766456781","Suluhu Amdany","Mother","0785739259"),
("0741367812","Daisy Auma","Mother","0791344537"),
("0755421123","Getrude Karen","Mother","0765748244");

 * sqlite:///stud_db.db
Done.
15 rows affected.

[]

In [25]:
%%sql
UPDATE contact_details
SET stud_email = (SELECT school_details.stud_email
FROM school_details, personal_details
WHERE school_details.stud_ID = personal_details.stud_ID
AND personal_details.phone_number = contact_details.phone_number);

 * sqlite:///stud_db.db
15 rows affected.

[]

In [26]:
%%sql
CREATE TABLE financial_details (stud_ID VARCHAR(15) ,stud_name VARCHAR(50) ,
sem_fee INTEGER(6) , fee_paid INTEGER(6),
PRIMARY KEY(stud_ID) );

 * sqlite:///stud_db.db
Done.

[]

In [27]:
%%sql
INSERT INTO financial_details(stud_ID,stud_name)
SELECT personal_details.stud_ID, personal_details.stud_name
FROM personal_details;

 * sqlite:///stud_db.db
15 rows affected.

[]

In [28]:
%sql UPDATE financial_details SET sem_fee = 25000, fee_paid=25000 WHERE stud_ID = "stud101";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [29]:
%sql UPDATE financial_details SET sem_fee= 25000, fee_paid=19000 WHERE stud_ID = "stud102";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [30]:
%sql UPDATE financial_details SET sem_fee= 21900, fee_paid=20000 WHERE stud_ID = "stud103";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [31]:
%sql UPDATE financial_details SET sem_fee= 22000, fee_paid=22000 WHERE stud_ID = "stud104";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [32]:
%sql UPDATE financial_details SET sem_fee= 25000, fee_paid=23400 WHERE stud_ID = "stud105";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [33]:
%sql UPDATE financial_details SET sem_fee= 25000, fee_paid=27000 WHERE stud_ID = "stud106";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [34]:
%sql UPDATE financial_details SET sem_fee= 24230, fee_paid=21200 WHERE stud_ID = "stud107";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [35]:
%sql UPDATE financial_details SET sem_fee= 25000, fee_paid=23500 WHERE stud_ID = "stud108";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [36]:
%sql UPDATE financial_details SET sem_fee= 25000, fee_paid=24500 WHERE stud_ID = "stud109";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [37]:
%sql UPDATE financial_details SET sem_fee= 25000, fee_paid=25000 WHERE stud_ID = "stud110";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [38]:
%sql UPDATE financial_details SET sem_fee= 26000, fee_paid=26000 WHERE stud_ID = "stud111";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [39]:
%sql UPDATE financial_details SET sem_fee= 25000, fee_paid=20900 WHERE stud_ID = "stud112";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [40]:
%sql UPDATE financial_details SET sem_fee= 25000, fee_paid=22300 WHERE stud_ID = "stud113";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [41]:
%sql UPDATE financial_details SET sem_fee= 19000, fee_paid=19000 WHERE stud_ID = "stud114";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [42]:
%sql UPDATE financial_details SET sem_fee= 20800, fee_paid=20800 WHERE stud_ID = "stud115";

 * sqlite:///stud_db.db
1 rows affected.

[]

In [43]:
%sql PRAGMA  SQL_safe_updates =ON;

 * sqlite:///stud_db.db
Done.

[]

In [44]:
%%sql
SELECT personal_details.stud_name,(personal_details.stud_ID) AS school_id,(school_details.stud_email) AS email,personal_details.phone_number
FROM personal_details INNER JOIN school_details ON personal_details.stud_ID=school_details.stud_ID;

 * sqlite:///stud_db.db
Done.

[('Hermione Granger', 'stud101', 'HermioneGranger@zinduaschool.ac', '0712345678'),
 ('Draco Malfo', 'stud102', 'DracoMalfo@zinduaschool.ac', '0723456781'),
 ('Jayden Wamashati', 'stud103', 'JaydenWamashati@zinduaschool.ac', '0734567812'),
 ('Ron Weasley', 'stud104', 'RonWeasley@zinduaschool.ac', '0745678123'),
 ('Dolores Umbridge', 'stud105', 'DoloresUmbridge@zinduaschool.ac', '0756781234'),
 ('Hedwig Tonks', 'stud106', 'HedwigTonks@zinduaschool.ac', '0767812345'),
 ('Chao Chang', 'stud107', 'ChaoChang@zinduaschool.ac', '0778123456'),
 ('Curfew Yaeitpm', 'stud108', 'CurfewYaeitpm@zinduaschool.ac', '0781234567'),
 ('Chaptr Mukenya', 'stud109', 'ChaptrMukenya@zinduaschool.ac', '0722345678'),
 ('Natalie Mpema', 'stud110', 'NatalieMpema@zinduaschool.ac', '0733456781'),
 ('Crew Nundi', 'stud111', 'CrewNundi@zinduaschool.ac', '0744567812'),
 ('Bandi Kagunda', 'stud112', 'BandiKagunda@zinduaschool.ac', '0755678123'),
 ('Testimony Omolo', 'stud113', 'TestimonyOmolo@zinduaschool.ac', '0766456781'),
 ('Career Mpya', 'stud114', 'CareerMpya@zinduaschool.ac', '0741367812'),
 ('Deamon Anduro', 'stud115', 'DeamonAnduro@zinduaschool.ac', '0744421123')]

In [45]:
%%sql
SELECT * FROM school_details

 * sqlite:///stud_db.db
Done.

[('stud101', 'Nakuru', 'Nairobi', 'In school', 'HermioneGranger@zinduaschool.ac'),
 ('stud102', 'Nairobi', 'Nakuru', 'In school', 'DracoMalfo@zinduaschool.ac'),
 ('stud103', 'Samburu', 'Nairobi', 'Out of school', 'JaydenWamashati@zinduaschool.ac'),
 ('stud104', 'Kericho', 'Nairobi', 'In school', 'RonWeasley@zinduaschool.ac'),
 ('stud105', 'Nyamira', 'Nakuru', 'In school', 'DoloresUmbridge@zinduaschool.ac'),
 ('stud106', 'Kisumu', 'Nairobi', 'Out of school', 'HedwigTonks@zinduaschool.ac'),
 ('stud107', 'Nakuru', 'Nairobi', 'Out of school', 'ChaoChang@zinduaschool.ac'),
 ('stud108', 'Kisumu', 'Mombasa', 'Out of school', 'CurfewYaeitpm@zinduaschool.ac'),
 ('stud109', 'Kericho', 'Mombasa', 'In school', 'ChaptrMukenya@zinduaschool.ac'),
 ('stud110', 'Nakuru', 'Mombasa', 'In school', 'NatalieMpema@zinduaschool.ac'),
 ('stud111', 'Kiambu', 'Turkana', 'In school', 'CrewNundi@zinduaschool.ac'),
 ('stud112', 'Nairobi', 'Nakuru', 'In school', 'BandiKagunda@zinduaschool.ac'),
 ('stud113', 'Samburu', 'Taita Taveta', 'In school', 'TestimonyOmolo@zinduaschool.ac'),
 ('stud114', 'Kericho', 'Nairobi', 'Out of school', 'CareerMpya@zinduaschool.ac'),
 ('stud115', 'Kiambu', 'Mombasa', 'In school', 'DeamonAnduro@zinduaschool.ac')]

In [46]:
%%sql
CREATE TABLE full_student_details AS
SELECT cd.stud_email, cd.phone_number, cd.next_of_kin_name, cd.next_of_kin_relation, cd.next_of_kin_contacts,
       sd.stud_ID, sd.current_home_county, sd.secondary_school_county, sd.residence,
       fd.stud_name, fd.sem_fee, fd.fee_paid
FROM contact_details cd
JOIN school_details sd ON cd.stud_email = sd.stud_email
JOIN financial_details fd ON sd.stud_ID = fd.stud_ID;

 * sqlite:///stud_db.db
Done.

[]

In [49]:
%%sql
INSERT INTO financial_details (stud_name) VALUES("Kingsline Kiprono"),("Benedict Murimi"),("Ezra Cheruiyot"),("James Kimani")

 * sqlite:///stud_db.db
4 rows affected.

[]

In [61]:
%%sql
ALTER TABLE financial_details ADD fee_cleared;

 * sqlite:///stud_db.db
Done.

[]

In [62]:
%%sql
UPDATE financial_details
SET fee_cleared = True
WHERE fee_paid = sem_fee;

 * sqlite:///stud_db.db
6 rows affected.

[]

In [63]:
%%sql
SELECT personal_details.national_ID,personal_details.stud_name FROM personal_details
INNER JOIN financial_details ON  personal_details.stud_ID=financial_details.stud_ID WHERE fee_cleared=True;

 * sqlite:///stud_db.db
Done.

[(344534, 'Hermione Granger'),
 (377302, 'Ron Weasley'),
 (339152, 'Natalie Mpema'),
 (339746, 'Crew Nundi'),
 (321746, 'Career Mpya'),
 (390234, 'Deamon Anduro')]

In [64]:
%%sql
SELECT SUM(fee_paid) FROM financial_details;

 * sqlite:///stud_db.db
Done.

[(339600,)]

In [66]:
%%sql
SELECT SUM(sem_fee)-SUM(fee_paid) FROM financial_details

 * sqlite:///stud_db.db
Done.

[(19330,)]

In [75]:
%%sql
SELECT COUNT(stud_ID),current_home_county FROM school_details
GROUP BY current_home_county;

 * sqlite:///stud_db.db
Done.

[(3, 'Kericho'),
 (2, 'Kiambu'),
 (2, 'Kisumu'),
 (2, 'Nairobi'),
 (3, 'Nakuru'),
 (1, 'Nyamira'),
 (2, 'Samburu')]

In [82]:
%%sql
SELECT COUNT(personal_details.stud_ID), school_details.secondary_school_county,personal_details.gender FROM school_details
 INNER JOIN personal_details ON school_details.stud_ID=personal_details.stud_ID
 GROUP BY secondary_school_county,gender;

 * sqlite:///stud_db.db
Done.

[(3, 'Mombasa', 'Female'),
 (1, 'Mombasa', 'Male'),
 (2, 'Nairobi', 'Female'),
 (4, 'Nairobi', 'Male'),
 (2, 'Nakuru', 'Female'),
 (1, 'Nakuru', 'Male'),
 (1, 'Taita Taveta', 'Male'),
 (1, 'Turkana', 'Male')]

In [91]:
%%sql
SELECT
    (SELECT COUNT(stud_ID) FROM full_student_details WHERE next_of_kin_relation = 'Mother') * 100.0 / (SELECT COUNT(*) FROM full_student_details) AS mother_percentage,
    (SELECT COUNT(stud_ID) FROM full_student_details WHERE next_of_kin_relation = 'Father') * 100.0 / (SELECT COUNT(*) FROM full_student_details) AS father_percentage;

 * sqlite:///stud_db.db
Done.

[(42.857142857142854, 57.142857142857146)]